
&НаСервере
Процедура ОбновитьБиблиографическоеПредставлениеСерия()
	Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеПериодикаВершина(ЭтаФорма);
КонецПроцедуры // ОбновитьБиблиографическоеПредставлениеСерия()

&НаКлиенте
Процедура ОбновитьПредставление(Команда)
	ОбновитьБиблиографическоеПредставлениеСерия();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьБиблиографическоеПредставлениеСерия();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчетныеЕдиницы.Параметры.УстановитьЗначениеПараметра("Серия",Объект.Ссылка);
	УчетныеЕдиницы.Параметры.УстановитьЗначениеПараметра("ПустаяСсылка",Справочники.удуСерии.ПустаяСсылка());
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры


