
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Тома.Параметры.УстановитьЗначениеПараметра("Многотомник",Объект.Ссылка);
	Тома.Параметры.УстановитьЗначениеПараметра("ПустаяСсылка",Справочники.удуМноготомники.ПустаяСсылка());
	Элементы.Тома.АвтоОбновление = Истина;
	Если Не ЭтоНовый() Тогда
		СформироватьПредставление();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Тома.Параметры.УстановитьЗначениеПараметра("Многотомник",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ЭтоНовый()
	Если Объект.Ссылка = Справочники.удуМноготомники.ПустаяСсылка() Тогда
	    Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции
	

&НаСервере
Процедура СформироватьПредставление()
	Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеМноготомника(ЭтаФорма);
	Если Объект.КоличествоТомов > 5 Тогда 
		Элементы.Представление.Высота = 7;	
	КонецЕсли;
	
КонецПроцедуры // СформироватьПредставление()

&НаКлиенте
Процедура ТомаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Представление = Представление;
КонецПроцедуры

&НаСервере
Процедура ДобавитьУчетнуюЕдиницуВМноготомник(Результат)
	Если ЗначениеЗаполнено(Результат) Тогда
		УчетнаяЕдиницаОбъект = Результат.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Результат.Многотомник) Тогда 
			УчетнаяЕдиницаОбъект.Многотомник = Объект.Ссылка;
			// Заполнить номер тома
			Запрос = Новый Запрос (
			 "ВЫБРАТЬ
			 |	удуУчетныеЕдиницы.Многотомник,
			 |	МАКСИМУМ(удуУчетныеЕдиницы.НомерТома) КАК НомерТома
			 |ИЗ
			 |	Справочник.удуУчетныеЕдиницы КАК удуУчетныеЕдиницы
			 |ГДЕ
			 |	удуУчетныеЕдиницы.Многотомник = &Многотомник
			 |
			 |СГРУППИРОВАТЬ ПО
			 |	удуУчетныеЕдиницы.Многотомник"
			);
			Запрос.УстановитьПараметр("Многотомник",Объект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			НомерТома = 1;
			Пока Выборка.Следующий() Цикл
				НомерТома = Выборка.НомерТома + 1;
			КонецЦикла;
			УчетнаяЕдиницаОбъект.НомерТома = НомерТома;	
			Если НомерТома > Объект.КоличествоТомов Тогда 
				Объект.КоличествоТомов = НомерТома;
			КонецЕсли;
			
			УчетнаяЕдиницаОбъект.Записать();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной учетной единицы многотомник уже указан");
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры // ДобавитьУчетнуюЕдиницуВМноготомник();

&НаСервере
Функция ПолучитьВидМатериала()
	Возврат Справочники.удуВидыМетодическихМатериалов.Книга;
КонецФункции // ПолучитьВидМатериала

&НаКлиенте
Процедура ДобавитьСуществующий(Команда)
	Если Не ЭтоНовый() Тогда
		ПараметрыВыбора = Новый Структура("ВидМатериала",ПолучитьВидМатериала());
		Результат = ОткрытьФормуМодально("Справочник.удуУчетныеЕдиницы.ФормаВыбора",ПараметрыВыбора);
		ДобавитьУчетнуюЕдиницуВМноготомник(Результат);
		Элементы.Тома.Обновить();
		СформироватьПредставление();
	Иначе 
		Ответ = Вопрос("Для добавления новых томов необходимо записать многотомник. Записать?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставление(Команда)
	СформироватьПредставление();
КонецПроцедуры





