
// Выполняет проверки перед стартом бизнес-процесса
Процедура ПередСтартомБизнесПроцесса(Объект, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Предмет) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ДелопроизводствоКлиентСервер.ЭтоСсылкаНаДокумент(Объект.Предмет) Тогда 
		
		ЗанятыеФайлы = РаботаСФайлами.ПолучитьЗанятыеФайлы(Объект.Предмет);
		Если ЗанятыеФайлы.Количество() > 0 Тогда 
			
			ПараметрыФормы = Новый Структура;	
			ПараметрыФормы.Вставить("СообщениеВопрос", 		НСТР("ru = 'Выполнить запуск бизнес-процесса?'"));
			ПараметрыФормы.Вставить("СообщениеЗаголовок", 	НСТР("ru = 'Следующие файлы приложенного документа заняты для редактирования:'"));
			ПараметрыФормы.Вставить("Заголовок", 			НСТР("ru = 'Запуск бизнес-процесса'"));
			ПараметрыФормы.Вставить("ВладелецФайла", 		Объект.Предмет);
			
			Результат = ОткрытьФормуМодально("Справочник.Файлы.Форма.СписокЗанятыхСВопросом", ПараметрыФормы);
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.Файлы") Тогда 
		
		Редактирует = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Предмет, "Редактирует");
		Если Не Редактирует.Пустая() Тогда 
			
			ТекстВопроса = НСТР("ru = 'Приложенный файл занят для редактирования. Выполнить запуск бизнес-процесса?'");
			Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСТР("ru = 'Запуск бизнес-процесса'"));
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

// Выполняет открытие карточки "Исполнителя", если он установлен
Процедура ОткрытьИсполнителя(Исполнитель) Экспорт
	
	Если Не Исполнитель.Пустая() Тогда
		ОткрытьЗначение(Исполнитель);
	КонецЕсли;	
	
КонецПроцедуры

Функция ПроверитьНаличиеЗанятыхФайлов(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Предмет) Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	ТекущийПользователь = РаботаСФайламиКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ТекущийПользователь;
	
	Если ДелопроизводствоКлиентСервер.ЭтоСсылкаНаДокумент(Объект.Предмет) Тогда 
		
		ЗанятыеФайлы = РаботаСФайлами.ПолучитьЗанятыеФайлы(Объект.Предмет, ТекущийПользователь);
		Если ЗанятыеФайлы.Количество() > 0 Тогда 
			
			ПараметрыФормы = Новый Структура;	
			ПараметрыФормы.Вставить("СообщениеВопрос", 		НСТР("ru = 'Выполнить задачу?'"));
			ПараметрыФормы.Вставить("СообщениеЗаголовок", 	НСТР("ru = 'Следующие файлы приложенного документа заняты вами для редактирования:'"));
			ПараметрыФормы.Вставить("Заголовок", 			НСТР("ru = 'Выполнение задачи'"));
			ПараметрыФормы.Вставить("ВладелецФайла", 		Объект.Предмет);
			ПараметрыФормы.Вставить("Редактирует", 			ТекущийПользователь);
			
			Результат = ОткрытьФормуМодально("Справочник.Файлы.Форма.СписокЗанятыхСВопросом", ПараметрыФормы);
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.Файлы") Тогда 
		
		Редактирует = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Предмет, "Редактирует");
		Если Редактирует = ТекущийПользователь Тогда 
			
			ТекстВопроса = НСТР("ru = 'Приложенный файл занят вами для редактирования. Выполнить задачу?'");
			Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСТР("ru = 'Выполнение задачи'"));
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	
	