
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(Список.Отбор, 
		Новый ПолеКомпоновкиДанных("Документ"), 
		Параметры.Документ);
		
	ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(СсылкиНаДокумент.Отбор, 
		Новый ПолеКомпоновкиДанных("СвязанныйДокумент"), 
		Параметры.Документ);	
		
КонецПроцедуры

&НаКлиенте
Процедура СсылкиНаДокументВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийДанные = Элементы.СсылкиНаДокумент.ТекущиеДанные;
	ОткрытьЗначение(ТекущийДанные.Документ);
	
КонецПроцедуры
