
&НаСервере
Процедура ОбновитьОтчет()
	
	Отчеты.удуУнифицированнаяФормаТ3.СформироватьОтчет(Отчет,Результат, ДанныеРасшифровки);
	удуУправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, Заголовок, Строка(ПараметрыСеанса.ТекущийПользователь));
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОбновитьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастрокаПоУмолчанию = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Если Параметры.ФормироватьПриОткрытии Тогда
		НастрокаПоУмолчанию.Отбор.Элементы.Очистить();
		
		удуУправлениеОтчетами.УстановитьОтбор(НастрокаПоУмолчанию, "Организация", Параметры.Организация,ВидСравненияКомпоновкиДанных.Равно,
		строка(Новый УникальныйИдентификатор()),Не Параметры.Организация.Пустая());
	
		удуУправлениеОтчетами.УстановитьОтбор(НастрокаПоУмолчанию, "ПодразделениеОрганизации", Параметры.ПодразделениеОрганизации,ВидСравненияКомпоновкиДанных.Равно,
		строка(Новый УникальныйИдентификатор()),ЗначениеЗаполнено(Параметры.ПодразделениеОрганизации));
	
		удуУправлениеОтчетами.УстановитьОтбор(НастрокаПоУмолчанию, "Должность", Справочники.Должности.ПустаяСсылка(),ВидСравненияКомпоновкиДанных.Равно,строка(Новый УникальныйИдентификатор()),Ложь);
		удуУправлениеОтчетами.УстановитьПараметр(НастрокаПоУмолчанию , "Период", ТекущаяДата(),,строка(Новый УникальныйИдентификатор()));
		
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	
	ФормироватьПриОткрытии=Параметры.ФормироватьПриОткрытии;
	Если ФормироватьПриОткрытии тогда
		АдресНастроек=ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.ПолучитьНастройки(),УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ФормироватьПриОткрытии и ЗначениеЗаполнено(АдресНастроек) Тогда 
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
		НаименованиеТекущегоВарианта="Основной";
		ОбновитьОтчет();
		ФормироватьПриОткрытии=Ложь;
	КонецЕсли;
	
КонецПроцедуры


