

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "Копирование" объекта
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		Физлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		Наименование = "";
		Если ВидДоговора = Перечисления.удуВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			НомерДоговора = Справочники.удуСотрудникиОрганизаций.ПолучитьНомерТрудовогоДоговора(ЭтотОбъект);	
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура - обработчик события "Заполнение" объекта
Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("СправочникСсылка.ФизическиеЛица") 
		И НЕ Основание.ЭтоГруппа Тогда
		Физлицо = Основание;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" объекта
//
// Процедура ПередЗаписью(Отказ)
//	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка.Пустая() и не ЭтотОбъект.ЭтоГруппа тогда
		 ЭтотОбъект.Актуальность=Истина;
	КонецЕсли;
	
	
	Если Не ЭтоГруппа И ЭтотОбъект.Физлицо.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сотрудника не задано физическое лицо!", СтатусСообщения.ОченьВажное);
		отказ=истина;
	КонецЕсли;
	
		
КонецПроцедуры // ПередЗаписью()


Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

