
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.РегистрационныйНомер) Тогда
		// Заполнение шапки
	
		Наименование = ДанныеЗаполнения.Наименование;
		Основание = ДанныеЗаполнения.Ссылка;
		Владелец = ДанныеЗаполнения.Ссылка;
		Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.Корреспонденты") Тогда
			ПолучательДок = Получатели.Добавить();
			ПолучательДок.Получатель = ДанныеЗаполнения.Получатель;
			ПолучательДок.Адресат = ДанныеЗаполнения.Адресат;
		Иначе
			Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.СпискиРассылкиПоКорреспондентам") Тогда
				Для Каждого Корреспондент Из ДанныеЗаполнения.Получатель.Получатели Цикл
					ПолучательДок = Получатели.Добавить();
					ПолучательДок.Получатель = Корреспондент.Получатель;
					ПолучательДок.Адресат = Корреспондент.Адресат;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		Сообщить ("Документ еще не зарегистрирован");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры



 