
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСервер()
	СписокИзбранных.Очистить();
	Избранное = ХранилищеСистемныхНастроек.Загрузить("Общее/ИзбранноеРаботыПользователя", "");
	Если Избранное = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	Для Каждого Элемент Из Избранное Цикл
		МассивСсылок.Добавить(Элемент.НавигационнаяСсылка);
	КонецЦикла;
	
	ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(МассивСсылок);
	
	Для Сч = 1 По ПредставленияСсылок.Количество() Цикл
		СписокИзбранных.Добавить(МассивСсылок[Сч - 1], ПредставленияСсылок[Сч - 1].Текст);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьВыполнить()
	ОбновитьСписокСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВыполнить()
	Если Элементы.Избранное.ТекущиеДанные <> Неопределено Тогда
		ПерейтиПоНавигационнойСсылке(Элементы.Избранное.ТекущиеДанные.Значение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыполнить()
	ФормаДобавления = ПолучитьФорму("Обработка.Избранное.Форма.ФормаДобавленияСсылки");
	Если ФормаДобавления.ОткрытьМодально() = КодВозвратаДиалога.ОК Тогда
		Если Не ДобавитьСсылкуИОбновитьСписокСервер(ФормаДобавления.Ссылка) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ссылка ""%1"" не найдена.'"),
				ФормаДобавления.Ссылка);
			
			Предупреждение(ТекстСообщения);
			
        КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ДобавитьСсылкуИОбновитьСписокСервер(НавСсылка)
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(НавСсылка);
	ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(Ссылки);
	Если ПредставленияСсылок.Количество() <> 0 Тогда
		Избранное = ХранилищеСистемныхНастроек.Загрузить("Общее/ИзбранноеРаботыПользователя", "");
		Если Избранное = Неопределено тогда
			Избранное = Новый ИзбранноеРаботыПользователя;
		КонецЕсли;	
		ЭлементИзбранного = Новый ЭлементИзбранногоРаботыПользователя;
		ЭлементИзбранного.НавигационнаяСсылка = НавСсылка;
		Избранное.Добавить(ЭлементИзбранного);
		ХранилищеСистемныхНастроек.Сохранить("Общее/ИзбранноеРаботыПользователя", "", Избранное);
		ОбновитьСписокСервер();
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УдалитьВыполнить()
	Если Элементы.Избранное.ТекущиеДанные <> Неопределено Тогда
		УдалитьСсылкуИОбновитьСписокСервер(Элементы.Избранное.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСсылкуИОбновитьСписокСервер(Идентификатор)
	Избранное = ХранилищеСистемныхНастроек.Загрузить("Общее/ИзбранноеРаботыПользователя", "");
	Избранное.Удалить(СписокИзбранных.Индекс(СписокИзбранных.НайтиПоИдентификатору(Идентификатор)));
	ХранилищеСистемныхНастроек.Сохранить("Общее/ИзбранноеРаботыПользователя", "", Избранное);
	ОбновитьСписокСервер();
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПерейтиВыполнить();
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПередУдалением(Элемент, Отказ)
	УдалитьВыполнить();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;	
	Если Не Копирование Тогда
		ДобавитьВыполнить();
 	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИзбранноеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		Для Каждого ОбъектПринятый Из ПараметрыПеретаскивания.Значение Цикл
			Ссылка = ПолучитьНавигационнуюСсылку(ОбъектПринятый);
			
			Если Не ДобавитьСсылкуИОбновитьСписокСервер(Ссылка) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ссылка ""%1"" не найдена.'"),
					Ссылка);
				
				Предупреждение(ТекстСообщения);
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры
