Функция ПроверитКорректностьЗаполненияТЧ()
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧастьПосещениеГруппы Цикл
		Если НЕ СтрокаТЧ.ПризнакПрисутствия И НЕ ЗначениеЗаполнено(СтрокаТЧ.ПричинаПропускаЗанятия) Тогда
			ЕстьОшибки = Истина;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'При пропуске ребенком занятия необходимо обязательно указывать причину пропуска занятия!'");
			Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьВоспитанники[" + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + "].ПричинаПропускаЗанятия'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();			
			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ЕстьОшибки;	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = ПроверитКорректностьЗаполненияТЧ();
	
	Движения.удуСведенияОПосещаемостиДОУ.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьПосещениеГруппы Из ТабличнаяЧастьПосещениеГруппы Цикл
		// Hегистр удуСведенияОПосещаемостиДОУ 
		Движение = Движения.удуСведенияОПосещаемостиДОУ.Добавить();
		Движение.Период = Дата;
		Движение.Учреждение = Учреждение;
		Движение.Группа = Группа;
		Движение.Ребенок = ТекСтрокаТабличнаяЧастьПосещениеГруппы.Ребенок;
		Движение.ПризнакПрисутствия = ТекСтрокаТабличнаяЧастьПосещениеГруппы.ПризнакПрисутствия;
		Движение.ПричинаПропускаЗанятия = ТекСтрокаТабличнаяЧастьПосещениеГруппы.ПричинаПропускаЗанятия;		
		Движение.Воспитатель = Воспитатель;
	КонецЦикла;
КонецПроцедуры
