
&НаКлиенте
Процедура КомандаОКЗакрыть(Команда)
	// Вставить содержимое обработчика.
	ОповеститьОВыборе(ПризнакСогласия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = ПолучитьОбщийМакет("МакетТекстК2");	
	СекцияОсновная = Макет.ПолучитьОбласть("Основная");	
	ТаблицаПредупреждение.Вывести(СекцияОсновная);
	ТаблицаПредупреждение.ОтображатьЗаголовки = Ложь;
	ТаблицаПредупреждение.ОтображатьСетку = Ложь;
	ТаблицаПредупреждение.АвтоМасштаб = Истина;
	ТаблицаПредупреждение.ТолькоПросмотр = Истина;	
	
	ПризнакСогласия = "НеСогласен";
КонецПроцедуры
