
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНумератор();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	НумераторДоступен = (Объект.СпособНумерации = Перечисления.СпособыНумерации.Автоматически);
	Элементы.Нумератор.Доступность = НумераторДоступен;
	Элементы.Нумератор.АвтоОтметкаНезаполненного = НумераторДоступен;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНумератор()
	Если Объект.СпособНумерации = Перечисления.СпособыНумерации.Автоматически Тогда 
		Объект.Нумератор = Справочники.Нумераторы.ТипыРеестра;
	Иначе
		Объект.Нумератор = Справочники.Нумераторы.ПустаяСсылка();
		Элементы.Нумератор.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры // ОбновитьНумератор()

&НаКлиенте
Процедура СпособНумерацииПриИзменении(Элемент)
	 ОбновитьНумератор();
КонецПроцедуры
