
&НаКлиенте
Процедура ОрганизацияДляОтбораПриИзменении(Элемент)
	
	удуОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
		
	Организация       = Настройки.Получить("Организация");
	
	удуОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Значение", Сотрудник);
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Сотрудник", Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Значение", Справочники.удуСотрудникиОрганизаций.ПустаяСсылка());
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Сотрудник", Справочники.удуСотрудникиОрганизаций.ПустаяСсылка());
	
КонецПроцедуры
