
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	Форма = ПолучитьФорму("Справочник.ВнутренниеДокументы.Форма.ФормаВводаНаОсновании", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	Если Форма.ОткрытьМодально() <> КодВозвратаДиалога.ОК Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	КопироватьФайлы = Новый СписокЗначений;
	Для Каждого СтрокаФайл Из Форма.Файлы Цикл
		Если СтрокаФайл.Пометка Тогда
			КопироватьФайлы.Добавить(СтрокаФайл.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.ВходящиеДокументы.Форма.ФормаЭлемента" Тогда
		УникальныйИдентификатор = ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор;
	Иначе
		УникальныйИдентификатор = Неопределено;
	КонецЕсли;
	
	ПараметрыВводаНаОсновании = Новый Структура;
	ПараметрыВводаНаОсновании.Вставить("Основание",			ПараметрКоманды);
	ПараметрыВводаНаОсновании.Вставить("Папка",				Форма.Папка);
	ПараметрыВводаНаОсновании.Вставить("ВидДокумента", 		Форма.ВидДокумента);
	ПараметрыВводаНаОсновании.Вставить("КопироватьФайлы", 	КопироватьФайлы);
	ПараметрыВводаНаОсновании.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрыВводаНаОсновании);
	ОткрытьФорму("Справочник.ВнутренниеДокументы.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.ВходящиеДокументы.Форма.ФормаЭлемента" Тогда
		ПараметрыВыполненияКоманды.Источник.Прочитать();
	КонецЕсли;	
	
КонецПроцедуры
