&НаСервере
Процедура УстановитьЗаголовокФормыЗаписиФизлица()
	
	Если ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		Заголовок="Фамилия, имя, отчество физ. лица: "+Запись.ФизЛицо.Наименование;
	Иначе
		Заголовок="Фамилия, имя, отчество физ. лица: -";
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры

