&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Текущие = Истина;
	Закрытые = Ложь;
	Отправленные = Ложь;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборСтатус = Перечисления.удуСтатусОтправки.Текущий;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Статус",ОтборСтатус);
	ПараметрыОтбора.Вставить("ВидДоставки", ОтборВидДоставки);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	 
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Статус"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Статус"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("Статус"),
			ПараметрыОтбора["Статус"]);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["ВидДоставки"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидДоставки"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидДоставки"),
			ПараметрыОтбора["ВидДоставки"]);
	КонецЕсли;

			
КонецПроцедуры


&НаКлиенте
Процедура ОтборВидДоставкиПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры



