
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПолучитьФорму("Справочник.ВнутренниеДокументы.Форма.ФормаВводаНаОснованииФайла",, ПараметрыВыполненияКоманды.Источник);
	Если Форма.ОткрытьМодально() <> КодВозвратаДиалога.ОК Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ПараметрыВводаНаОсновании = Новый Структура;
	ПараметрыВводаНаОсновании.Вставить("Основание",		ПараметрКоманды);
	ПараметрыВводаНаОсновании.Вставить("Папка",			Форма.Папка);
	ПараметрыВводаНаОсновании.Вставить("ВидДокумента",	Форма.ВидДокумента);
	ПараметрыВводаНаОсновании.Вставить("Организация",	Форма.Организация);
	ПараметрыВводаНаОсновании.Вставить("Корреспондент",	Форма.Корреспондент);
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрыВводаНаОсновании);
	ОткрытьФорму("Справочник.ВнутренниеДокументы.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры
