
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	Форма = ПолучитьФорму("Справочник.ИсходящиеДокументы.Форма.ФормаВводаНаОсновании", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	Если Форма.ОткрытьМодально() <> КодВозвратаДиалога.ОК Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	КопироватьФайлы = Новый СписокЗначений;
	Для Каждого СтрокаФайл Из Форма.Файлы Цикл
		Если СтрокаФайл.Пометка Тогда
			КопироватьФайлы.Добавить(СтрокаФайл.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	
	ПараметрыВводаНаОсновании = Новый Структура;
	ПараметрыВводаНаОсновании.Вставить("Основание",			ПараметрКоманды);
	ПараметрыВводаНаОсновании.Вставить("ГрифДоступа",		Форма.ГрифДоступа);
	ПараметрыВводаНаОсновании.Вставить("ВидДокумента", 		Форма.ВидДокумента);
	ПараметрыВводаНаОсновании.Вставить("КопироватьФайлы", 	КопироватьФайлы);
	ПараметрыВводаНаОсновании.Вставить("Получатель", 		Форма.Получатель);
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрыВводаНаОсновании);
	ОткрытьФорму("Справочник.ИсходящиеДокументы.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры
