

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АвторИРоль =  Новый Структура();
	АвторИРоль.Вставить("Автор",Элементы.Список.ТекущиеДанные.Ссылка);
	АвторИРоль.Вставить("Роль",РольАвтора);
	Закрыть(АвторИРоль);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АвторИРоль =  Новый Структура();
	АвторИРоль.Вставить("Автор",Значение);
	АвторИРоль.Вставить("Роль",РольАвтора);
	Закрыть(АвторИРоль);
КонецПроцедуры
