

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидКорреспондентовФизЛицо = Перечисления.ВидыКорреспондентов.ФизЛицо;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	ВидКорреспондента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущиеДанные.Получатель, "ВидКорреспондента");
	
	Если ВидКорреспондента = ВидКорреспондентовФизЛицо Тогда
		Элементы.Адресат.ТолькоПросмотр = Истина;
	Иначе	
		Элементы.Адресат.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	ТекущийПолучатель = ТекущиеДанные.Получатель;
	Если ЗначениеЗаполнено(ТекущийПолучатель) И ВидКорреспондента = ВидКорреспондентовФизЛицо Тогда
		
		Для Каждого Строка Из Объект.Получатели Цикл
			Если (Строка.Получатель = ТекущийПолучатель) И (Строка.НомерСтроки <> ТекущиеДанные.НомерСтроки) Тогда 
				ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Получатель ""%1"" уже выбран.'"),
					ТекущийПолучатель);
				Предупреждение(ТекстПредупреждения);
				ТекущиеДанные.Получатель = Неопределено;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	
	ТекущийПолучатель = ТекущиеДанные.Получатель;
	ТекущийАдресат = ТекущиеДанные.Адресат;
	Если ЗначениеЗаполнено(ТекущийАдресат) И ТипЗнч(ТекущийПолучатель) = Тип("СправочникСсылка.Корреспонденты") Тогда
		
		Для Каждого Строка Из Объект.Получатели Цикл
			Если (Строка.Получатель = ТекущийПолучатель) И (Строка.Адресат = ТекущийАдресат) И (Строка.НомерСтроки <> ТекущиеДанные.НомерСтроки) Тогда 
				ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Адресат ""%1"" получателя ""%2"" уже выбран.'"),
					ТекущийАдресат,
					ТекущийПолучатель);
				Предупреждение(ТекстПредупреждения);
				ТекущиеДанные.Адресат = Неопределено;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ВидКорреспондента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущиеДанные.Получатель, "ВидКорреспондента");
	
	Если ВидКорреспондента = ВидКорреспондентовФизЛицо Тогда
		Элементы.Адресат.ТолькоПросмотр = Истина;
	Иначе	
		Элементы.Адресат.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	Форма = ПолучитьФорму("Справочник.Корреспонденты.ФормаВыбора", , ЭтаФорма);
	Форма.ЗакрыватьПриВыборе = Ложь;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	НоваяСтрока = Объект.Получатели.Добавить();
	НоваяСтрока.Получатель = ВыбранноеЗначение;
	
КонецПроцедуры



