&НаСервере
Процедура ОбновитьСведенияОКмплектовании()
	// Отбор по учреждению
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.Ссылка КАК Ребенок,
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.Пол КАК Пол,
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.ДатаРождения КАК ДатаРождения,
	               |	удуСведенияОКомплекатцииГруппы.Регистратор КАК ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.удуСведенияОКомплекатцииГруппы КАК удуСведенияОКомплекатцииГруппы
	               |ГДЕ
	               |	удуСведенияОКомплекатцииГруппы.Группа = &Группа
	               |	И удуСведенияОКомплекатцииГруппы.ПериодКомплектования = &ПериодКомплектования";
				   
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	Запрос.УстановитьПараметр("ПериодКомплектования", ПериодКомплектования);
	
	сэРезультатВыполнения = запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(сэРезультатВыполнения, "ТабличнаяЧастьДети");
КонецПроцедуры

&НаКлиенте
Процедура ПериодКомплектованияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТекущийГод = Год(ТекущаяДата());
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Формат(ТекущийГод - 1, "ЧГ=0") + "/" + Формат(ТекущийГод, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод, "ЧГ=0") + "/" + Формат(ТекущийГод + 1, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 1, "ЧГ=0") + "/" + Формат(ТекущийГод + 2, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 2, "ЧГ=0") + "/" + Формат(ТекущийГод + 3, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 3, "ЧГ=0") + "/" + Формат(ТекущийГод + 4, "ЧГ=0"));
	
	НайденноеЗначение = СписокВыбора.НайтиПоЗначению(Элемент.ВыделенныйТекст);
	Если НайденноеЗначение <> Неопределено Тогда
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент, НайденноеЗначение);
	Иначе
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент);
	КонецЕсли;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ПериодКомплектования = ВыбранноеЗначение.Значение;
		ОбновитьСведенияОКмплектовании();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьДетиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ПередаваемыеПараметры = Новый Структура("Ключ", Элементы.ТекущиеДанные.ДокументРегистратор);
	ОткрытьФормуМодально("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);
КонецПроцедуры
