
// Открывает форму выбора пользователя
Процедура ВыбратьПользователя(ЭлементПользователь, РеквизитПользователь) Экспорт 
	
	ПараметрыФормы = Новый Структура("Пользователь", РеквизитПользователь);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораСПодразделениями", ПараметрыФормы, ЭлементПользователь);
	
КонецПроцедуры	

// Открывает форму выбора иисполнителя
Процедура ВыбратьИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель) Экспорт 
	
	ПараметрыФормы = Новый Структура("Исполнитель", РеквизитИсполнитель);
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы, ЭлементИсполнитель);
	
КонецПроцедуры	

// Открывает форму подбора иисполнителей
Процедура ПодборИсполнителей(АдресВременногоХранилища, ФормаВладелец) Экспорт 
	
	ПараметрыФормы = Новый Структура("АдресВременногоХранилища", АдресВременногоХранилища);
	ОткрытьФорму("ОбщаяФорма.ПодборИсполнителей", ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры	
