&НаСервере
Процедура СформироватьТаблицуВоспитателей()
	Для Каждого СтрокаВоспитателя Из ПараметрГруппа.ВоспитательныйПерсонал Цикл
		НоваяСтрокаТаблицы = РеквизитТаблицаВоспитателей.Добавить();
		НоваяСтрокаТаблицы.Воспитатель = СтрокаВоспитателя.РаботникУчреждения;
		НоваяСтрокаТаблицы.ДолжностьВоспитателя = СтрокаВоспитателя.Должность;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура РеквизитТаблицаВоспитателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Воспитатель);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТаблицуВоспитателей();
КонецПроцедуры
