
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Список = Новый СписокЗначений();
	Список.Добавить("Входящий документ");
	Список.Добавить("Исходящий документ");
	Список.Добавить("Внутренний документ");
	
	ПараметрОткрытия = Новый Структура("Ключ, Заголовок", Список, Нстр("ru = 'Выберите тип документа'"));
	ФормаВыбора = ПолучитьФорму("ОбщаяФорма.удуФормаВыбораЗначений", ПараметрОткрытия);
	
	ТипДокумента = ФормаВыбора.ОткрытьМодально();	
	Комментарий = ВвестиСтроку(,"Введите комментарий");
	
	Если ТипДокумента = "Входящий документ" Тогда
		ФормаВыбора = ПолучитьФорму("Справочник.ВходящиеДокументы.ФормаВыбора");
	ИначеЕсли ТипДокумента = "Исходящий документ" Тогда
		ФормаВыбора = ПолучитьФорму("Справочник.ИсходящиеДокументы.ФормаВыбора");
	Иначе
		ФормаВыбора = ПолучитьФорму("Справочник.ВнутренниеДокументы.ФормаВыбора");
	КонецЕсли;
	
	ВыбранныйДокумент = ФормаВыбора.ОткрытьМодально();
	
	удуРегистрацияУчетныхДокументовСервер.ЗаписатьСвязь(ПараметрКоманды, ВыбранныйДокумент, ТипДокумента, Комментарий);
	Вопрос(Нстр("ru = 'Связь успешно создана.'"), РежимДиалогаВопрос.ОК);
		
КонецПроцедуры