&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбораПоРаботнику = РеквизитСведенияОРаботе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоРаботнику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоРаботнику.Использование = Истина;
	ЭлементОтбораПоРаботнику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Работник");
	ЭлементОтбораПоРаботнику.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоРаботнику.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбораПоУченику = РеквизитСведенияОбОбразовании.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУченику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУченику.Использование = Истина;
	ЭлементОтбораПоУченику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Обучающийся");
	ЭлементОтбораПоУченику.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУченику.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	ЭлементОтбораПоРодителю = РеквизитСоставСемьи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоРодителю.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоРодителю.Использование = Истина;
	ЭлементОтбораПоРодителю.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЧленСемьи");
	ЭлементОтбораПоРодителю.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоРодителю.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	РеквизитСоставСемьи.Параметры.УстановитьЗначениеПараметра("Мальчик", Перечисления.удуПол.Мальчик);
	
	ЭтаФорма.Элементы.ГруппаСведенияОМестеРаботы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	ЭтаФорма.Элементы.РеквизитСведенияОРаботе.Видимость = Булево(Объект.Работает = 1);
	ЭтаФорма.Элементы.РеквизитСведенияОбОбразовании.Видимость = Булево(Объект.Работает = 0);
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Работает = 2;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОРаботе.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Работник" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОбОбразовании.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Обучающийся" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЭлемент Из РеквизитСоставСемьи.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "ЧленСемьи" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаСведенияОМестеРаботы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитСоставСемьиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "Ребенок" Тогда		
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.ФормаОбъекта", ПередаваемыеПараметры, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолеРаботаетПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЭтаФорма.Элементы.РеквизитСведенияОРаботе.Видимость = Булево(Объект.Работает = 1);
	ЭтаФорма.Элементы.РеквизитСведенияОбОбразовании.Видимость = Булево(Объект.Работает = 0);	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененУдуРодитель", Объект.Ссылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)	
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры


