
&НаКлиенте
Процедура НачалоВыбораДокумента(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("ВходящиеДокументы", 	"Входящий документ");
	СписокТипов.Добавить("ИсходящиеДокументы", 	"Исходящий документ");
	СписокТипов.Добавить("ВнутренниеДокументы", "Внутренний документ");
	
	ВыбранныйТип = ВыбратьИзСписка(СписокТипов, Элемент);
	Если ВыбранныйТип <> Неопределено Тогда 
		ОткрытьФорму("Справочник." + ВыбранныйТип.Значение + ".ФормаВыбора", , Элемент);
	КонецЕсли;
	
КонецПроцедуры
