&НаСервере
Процедура УстановитьЗаголовокФормыЗаписиФизлица()
	
	Заголовок="Семейное положение физ. лица: "+Запись.ФизЛицо.Наименование;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры

