&НаСервере
Функция КорректностьУказанияЧленаСемьи(ПереданныйПараметр, ИскатьУЭтогоРебенка)
	Если ИскатьУЭтогоРебенка Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуСоставСемьиРебенка.СтепеньРодства
		               |ИЗ
		               |	РегистрСведений.удуСоставСемьиРебенка КАК удуСоставСемьиРебенка
		               |ГДЕ
		               |	удуСоставСемьиРебенка.ЧленСемьи = &ЧленСемьи
		               |	И удуСоставСемьиРебенка.Ребенок = &Ребенок";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ЧленСемьи", ПереданныйПараметр);
		Запрос.УстановитьПараметр("Ребенок", Запись.Ребенок);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Если РезультатЗапроса.Количество() > 0 Тогда		
			Возврат РезультатЗапроса.Получить(РезультатЗапроса.Количество() - 1).СтепеньРодства;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуСоставСемьиРебенка.Ребенок
		               |ИЗ
		               |	РегистрСведений.удуСоставСемьиРебенка КАК удуСоставСемьиРебенка
		               |ГДЕ
		               |	удуСоставСемьиРебенка.ЧленСемьи = &ЧленСемьи";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ЧленСемьи", ПереданныйПараметр);		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда		
			Возврат РезультатЗапроса.Получить(РезультатЗапроса.Количество() - 1).Ребенок;
		Иначе
			Возврат Неопределено;
		КонецЕсли;			
	КонецЕсли;
КонецФункции

&НаСервере
Функция КорректностьСтепениРодства(ПереданныйПараметр)
	ТекстЗапроса = "ВЫБРАТЬ
				   |	удуСоставСемьиРебенка.ЧленСемьи
				   |ИЗ
				   |	РегистрСведений.удуСоставСемьиРебенка КАК удуСоставСемьиРебенка
				   |ГДЕ
				   |	удуСоставСемьиРебенка.Ребенок = &Ребенок
				   |	И удуСоставСемьиРебенка.СтепеньРодства = &СтепеньРодства";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ребенок", Запись.Ребенок);
	Запрос.УстановитьПараметр("СтепеньРодства", ПереданныйПараметр);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если (ПереданныйПараметр = Справочники.удуСтепениРодства.Мать) Или
		(ПереданныйПараметр = Справочники.удуСтепениРодства.Отец) Или
		(ПереданныйПараметр = Справочники.удуСтепениРодства.ПриемнаяМать) Или
		(ПереданныйПараметр = Справочники.удуСтепениРодства.ПриемныйОтец) Тогда
		// проверяем единое существование отцов и матерей
		Если РезультатЗапроса.Количество() > 0 Тогда
			Возврат 1;
		Иначе
			Возврат 0;
		КонецЕсли;			
	ИначеЕсли (ПереданныйПараметр = Справочники.удуСтепениРодства.Бабушка) Или
		(ПереданныйПараметр = Справочники.удуСтепениРодства.Дедушка) Тогда
		// проверяем наличие максимум двух бабушек
		Если РезультатЗапроса.Количество() > 1 Тогда
			Возврат 2;
		Иначе
			Возврат 0;
		КонецЕсли;			
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ВыборОсуществленКорректно = Истина;
	НайденнаяСтепеньРодства = КорректностьУказанияЧленаСемьи(ВыбранноеЗначение, Истина);
	Если НайденнаяСтепеньРодства <> Неопределено Тогда
		ВыборОсуществленКорректно = Ложь;
		Вопрос(Строка(ВыбранноеЗначение) + " уже входит в состав семьи ребенка как " + Строка(НайденнаяСтепеньРодства), РежимДиалогаВопрос.ОК);			
	Иначе			
		НайденныйРебенок = КорректностьУказанияЧленаСемьи(ВыбранноеЗначение, Ложь);
		Если НайденныйРебенок <> Неопределено Тогда
			ВыборОсуществленКорректно = Ложь;
			Вопрос(Строка(ВыбранноеЗначение) + " уже входит в состав семьи другого ребенка: " + Строка(НайденныйРебенок), РежимДиалогаВопрос.ОК);			
		КонецЕсли;
	КонецЕсли;
	
	Если ВыборОсуществленКорректно Тогда
		Запись.ЧленСемьи = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СтепеньРодстваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	КоличествоИмеющихсяРодственников = КорректностьСтепениРодства(ВыбранноеЗначение);
	Если КоличествоИмеющихсяРодственников > 0 Тогда
		Если КоличествоИмеющихсяРодственников = 1 Тогда
			Вопрос("У ребенка уже имеется """ + Строка(ВыбранноеЗначение) + """", РежимДиалогаВопрос.ОК);
			СтандартнаяОбработка = Ложь;				
		Иначе
			Вопрос("У ребенка уже имеется """ + Строка(ВыбранноеЗначение) + """ и причем 2!", РежимДиалогаВопрос.ОК);
			СтандартнаяОбработка = Ложь;				
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры

