
&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	
	Если Не ПустаяСтрока(СтрокаПоиска) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = СтрокаПоиска;
		// Дошкольное учреждение
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе 
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Список.Отбор.Элементы.Очистить();
	
	Если Не ПустаяСтрока(ИНН) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИНН");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ИНН;
		// Дошкольное учреждение
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе 
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;	
КонецПроцедуры
