
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Предопределенный Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодыСменыВремяНачалаПриИзменении(Элемент)
	
	СтрокаТЧ=Элементы.ПериодыСмены.ТекущиеДанные;
	Если СтрокаТЧ.ПериодыСменыВремяНачала = Дата(1,1,1, 23,59,0) Тогда
		СтрокаТЧ.ПериодыСменыВремяНачала =  Дата(1,1,1, 23,59,59) ;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодыСменыВремяОкончанияПриИзменении(Элемент)
	
	СтрокаТЧ=Элементы.ПериодыСмены.ТекущиеДанные;
	Если СтрокаТЧ.ПериодыСменыВремяНачала = Дата(1,1,1, 23,59,0) Тогда
		СтрокаТЧ.ПериодыСменыВремяНачала =  Дата(1,1,1, 23,59,59) ;
	КонецЕсли;
	
КонецПроцедуры
