 


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	// наименование
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Наименование"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Наименование"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаСодержит(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("Наименование"),
			ПараметрыОтбора["Наименование"]);
	КонецЕсли;
		
	// автор
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Автор"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("АвторПредставление"));
	Иначе
		Если Тип("СправочникСсылка.удуАвторы") = ТипЗнч(ПараметрыОтбора["Автор"]) Тогда
			ОтборПоАвтору = ПараметрыОтбора["Автор"].ПолучитьОбъект().Наименование;
		Иначе 
			ОтборПоАвтору = ПараметрыОтбора["Автор"];
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаСодержит(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("АвторПредставление"),
			ОтборПоАвтору);
	КонецЕсли;	
	
	// направление
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Направление"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("НаправлениеДеятельностиДОУ"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("НаправлениеДеятельностиДОУ"),
			ПараметрыОтбора["Направление"]);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Наименование",ОтборНаименование);
	ПараметрыОтбора.Вставить("Автор", 	ОтборАвтор);
	ПараметрыОтбора.Вставить("Направление",	ОтборНаправление);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаименованиеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеТекущейЗаписи(Код)
	Представление = Справочники.удуУчетныеЕдиницы.НайтиПоКоду(Код).Представление;
КонецПроцедуры // ЗаполнитьПредставлениеТекущейЗаписи(Код)

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
		Код = Элементы.Список.ТекущиеДанные.Код;
		ЗаполнитьПредставлениеТекущейЗаписи(Код);
	КонецЕсли;
КонецПроцедуры

