 ////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура НастройкаФормы()
	
	Если Объект.Ссылка.Пустая() и Объект.Родитель.Пустая() тогда
		Элементы.Организация.Доступность=Истина;
	Иначе	
		 Элементы.Организация.Доступность=Ложь;	 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьОрганизацию(Проверка=Ложь)
	
	Если Объект.Ссылка.Пустая() тогда
		Если Объект.Родитель.Пустая()  тогда
			Объект.Организация=?(Объект.Организация.Пустая(),Константы.удуОсновноеУчреждение.Получить(),Объект.Организация);	
		Иначе 	
			Объект.Организация=Объект.Родитель.Организация;
		КонецЕсли;
	ИначеЕсли Проверка тогда
		Если не Объект.Родитель.Организация.Пустая() и не Объект.Организация=Объект.Родитель.Организация тогда 
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подразделение  "+Объект.Родитель+" не относится к организации "+Объект.Организация,СтатусСообщения.Важное);
			 Объект.Родитель=мРодитель;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мРодитель=Объект.Родитель;	
	НастройкаФормы();
	ПроставитьОрганизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	НастройкаФормы();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	НастройкаФормы();
	ПроставитьОрганизацию(Истина);
    мРодитель=Объект.Родитель;
	
КонецПроцедуры


