
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(СокрЛП(Объект.Имя)) Тогда
		Объект.Инициалы = Лев(Объект.Имя,1) + ".";
		Объект.Наименование = Объект.Наименование + Лев(Объект.Имя,1) + ". "; 
	КонецЕсли;
	Если ЗначениеЗаполнено(СокрЛП(Объект.Отчество)) Тогда
		Объект.Инициалы = Объект.Инициалы + " " + Лев(Объект.Отчество,1) + ".";
		Объект.Наименование = Объект.Наименование + Лев(Объект.Отчество,1) + ". "; 
	КонецЕсли;
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + Объект.Инициалы;
КонецПроцедуры


