
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.удуМноготомники") Тогда
		// Заполнение шапки
		ВидМатериала = Справочники.удуВидыМетодическихМатериалов.Книга;
		Многотомник = ДанныеЗаполнения.Ссылка;
		Запрос = Новый Запрос(
		 "ВЫБРАТЬ
		 |	МАКСИМУМ(удуУчетныеЕдиницы.НомерТома) КАК НомерТома
		 |ИЗ
		 |	Справочник.удуУчетныеЕдиницы КАК удуУчетныеЕдиницы
		 |ГДЕ
		 |	удуУчетныеЕдиницы.Многотомник = &Многотомник
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	удуУчетныеЕдиницы.Многотомник"
		);
		Запрос.УстановитьПараметр("Многотомник",Многотомник);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерТома = Выборка.НомерТома + 1;	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.удуСерии") Тогда	
		ВидМатериала = Справочники.удуВидыМетодическихМатериалов.ПериодическоеИздание;
		Серия = ДанныеЗаполнения.Ссылка;
		Учредитель = ДанныеЗаполнения.Учредитель;
		КоличествоСтраниц = ДанныеЗаполнения.КоличествоСтраниц;
		Иллюстрации = ДанныеЗаполнения.Иллюстрации;
		ТаблицаИздательства = ДанныеЗаполнения.Издательства.Выгрузить();
		Издательства.Загрузить(ТаблицаИздательства);
		СведенияОтносящиесяКЗаглавию = ДанныеЗаполнения.СведенияОтносящиесяКЗаглавию;
		Наименование = ДанныеЗаполнения.Наименование;
	КонецЕсли;

КонецПроцедуры


