
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	// РаботаСФайлами
	ОбменФайлами.ПриОтправкеДанныхФайла(ЭлементДанных, СозданиеНачальногоОбраза);
	// Конец РаботаСФайлами
КонецПроцедуры

Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	// РаботаСФайлами
	ОбменФайлами.ПриОтправкеДанныхФайла(ЭлементДанных);
	// Конец РаботаСФайлами
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	// РаботаСФайлами
	ОбменФайлами.ПриПолученииДанныхФайла(ЭлементДанных);
	// Конец РаботаСФайлами
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	// РаботаСФайлами
	ОбменФайлами.ПриПолученииДанныхФайла(ЭлементДанных);
	// Конец РаботаСФайлами
КонецПроцедуры


