
&НаКлиенте
Процедура КатегорияНаправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ПереданныеПараметры = Новый Структура("ВидПрограммы", "Направления");
	
	Результат = ОткрытьФормуМодально("Справочник.удуКатегорииПрограммПроектов.ФормаВыбора", ПереданныеПараметры);
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Запись.КатегорияНаправления = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНаправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ПереданныеПараметры = Новый Структура("ВидПрограммы", "Направления");
	
	Результат = ОткрытьФормуМодально("Справочник.удуНаименованияПрограммПроектов.ФормаВыбора", ПереданныеПараметры);
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Запись.НаименованиеНаправления = Результат;
	КонецЕсли;	
КонецПроцедуры
