////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление конфигурации"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Получает настройки помощника обновления из хранилища общих настроек.
//
// Подробнее - см. описание ОбновлениеКонфигурации.ПолучитьСтруктуруНастроекПомощника().
//
Функция ПолучитьСтруктуруНастроекПомощника() Экспорт
	
	Возврат ОбновлениеКонфигурации.ПолучитьСтруктуруНастроекПомощника();
	
КонецФункции

// Записывает настройки помощника обновления в хранилище общих настроек.
//
// Подробнее - см. описание ОбновлениеКонфигурации.ЗаписатьСтруктуруНастроекПомощника().
//
Процедура ЗаписатьСтруктуруНастроекПомощника(НастройкиОбновленияКонфигурации, СообщенияДляЖурналаРегистрации = Неопределено) Экспорт
	
	ОбновлениеКонфигурации.ЗаписатьСтруктуруНастроекПомощника(НастройкиОбновленияКонфигурации, СообщенияДляЖурналаРегистрации);
	
КонецПроцедуры

// Формирует имя исполняемого файла клиента.
//
// Подробнее - см. описание ОбновлениеКонфигурации.ИмяИсполняемогоФайлаКлиента().
//
Функция ИмяИсполняемогоФайлаКлиента() Экспорт
	
	Возврат ОбновлениеКонфигурации.ИмяИсполняемогоФайлаКлиента();
	
КонецФункции
