
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Владелец) Тогда
		НовВладелец = Объект.Владельцы.Добавить();
		НовВладелец.УчетнаяЕдиница = Параметры.Владелец;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставление()
	Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеСоставныеЧасти(ЭтаФорма);
КонецПроцедуры // ОбновитьПредставление()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьПредставление();
КонецПроцедуры
