
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	удуРеестрыОтправкиПакеты.Номер
	|ИЗ
	|	Справочник.удуРеестрыОтправки.Пакеты КАК удуРеестрыОтправкиПакеты
	|ГДЕ
	|	удуРеестрыОтправкиПакеты.Ссылка = &Ссылка
	|	И удуРеестрыОтправкиПакеты.Корреспондент = &Корреспондент
	|	И удуРеестрыОтправкиПакеты.Номер <> &Номер"
	);
	Запрос.УстановитьПараметр("Ссылка",Параметры.РеестрСсылка);
	Запрос.УстановитьПараметр("Корреспондент",Параметры.Корреспондент);
	Запрос.УстановитьПараметр("Номер",Параметры.Номер);


	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТЧ = Пакеты.Добавить();	
		НоваяСтрокаТЧ.Номер = Выборка.Номер;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Пакеты.Количество() = 0 Тогда 
		Вопрос("Пакетов с указанным корреспондентом для перемещения не найдено",РежимДиалогаВопрос.ОК);
		Закрыть(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Переместить(Команда)
	Если ЗначениеЗаполнено(Элементы.Пакеты.ТекущиеДанные.Номер) Тогда 	
		Закрыть(Элементы.Пакеты.ТекущиеДанные.Номер);
	Иначе
		Вопрос("Пакет для перемещения не выбран",РежимДиалогаВопрос.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры



