
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		НаименованиеВидаПрограммы = Параметры.ВидПрограммы;
		ЭлементОтбораПоВидуПрограммы = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПоВидуПрограммы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПоВидуПрограммы.Использование = Истина;
		ЭлементОтбораПоВидуПрограммы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПрограммыПроекта");
		Если НаименованиеВидаПрограммы = "ОбразовательныеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.АккредитованныеОбразовательныеПрограммы;
		ИначеЕсли НаименованиеВидаПрограммы = "РеализуемыеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.РеализуемыеПрограммыПроекты;
		ИначеЕсли НаименованиеВидаПрограммы = "СоциальныеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.СоциальныеПрограммыПроекты;
		ИначеЕсли НаименованиеВидаПрограммы = "Направления" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.НаправленияДополнительногоОбразования;
		КонецЕсли;	
		ЭлементОтбораПоВидуПрограммы.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Исключение
	КонецПопытки;		
КонецПроцедуры
