
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ТекущееЗначение)Тогда 
		Элементы.Список.ТекущаяСтрока=Параметры.ТекущееЗначение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.АдресНастройкиОтбора)тогда
		
		НастройкиОтбора=ПолучитьИзВременногоХранилища(Параметры.АдресНастройкиОтбора);
		
		удуУправлениеОтчетами.СкопироватьЭлементыОтбораВГруппуСписка(Список.Отбор,НастройкиОтбора.Отбор.Элементы);
		
	КонецЕсли;
	
КонецПроцедуры
