
&НаСервере
Процедура ОтработатьПереключательГражданство()
	
	Если ПереключательГражданство=1 Тогда
		мСтрана = Страна;
		Страна = Справочники.СтраныМира.ПустаяСсылка();
	Иначе
		Страна = мСтрана;
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере
Процедура УстановитьЗаголовокФормыЗаписиФизлица()
	
	Заголовок="Гражданство физ. лица: "+Запись.ФизЛицо.Наименование;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыЗаписиФизлица();

	// установим переключатель в форме в соответствии с выбранным гражданством
	Страна=Запись.Страна;
	ЛицоБезГражданства = Запись.Страна = Справочники.СтраныМира.ЛицоБезГражданства;
	Элементы.Страна.ТолькоПросмотр = ЛицоБезГражданства;
	Если ЛицоБезГражданства Тогда
		Страна = Справочники.СтраныМира.ПустаяСсылка();
		ПереключательГражданство=1;
	КонецЕсли;	
	мСтрана=Страна;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры


&НаКлиенте
Процедура ПереключательГражданствоПриИзменении(Элемент)
	
	ОтработатьПереключательГражданство();
	Модифицированность=Истина;
	Элементы.Страна.ТолькоПросмотр = Булево(ПереключательГражданство);
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	
	Запись.Страна = Страна;
	Модифицированность=Истина;
	
КонецПроцедуры






