&НаСервере
Процедура СформироватьТаблицуДокументовПропуска();
	ПереданнаяТаблицаЗначений = ЗначениеИзСтрокиВнутр(ПереданнаяСтрока);
	Для Каждого СтрокаДокумента Из ПереданнаяТаблицаЗначений Цикл
		НоваяСтрокаДокумента = ТаблицаДокументовПропуска.Добавить();
		НоваяСтрокаДокумента.ДеньПропуска = СтрокаДокумента.ДеньПропуска;
		НоваяСтрокаДокумента.ПричинаПропуска = СтрокаДокумента.ПричинаПропуска;
		НоваяСтрокаДокумента.Уважительная = СтрокаДокумента.Уважительная;
		НоваяСтрокаДокумента.ДокументПропуска = СтрокаДокумента.ДокументПропуска;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПропускаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументПропуска) Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументПропуска);
		ОткрытьФормуМодально("Справочник.удуДокументыПропускаЗанятий.Форма.ФормаЭлемента", ПередаваемыеПараметры, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТаблицуДокументовПропуска();	
КонецПроцедуры
