
&НаКлиенте
Процедура ОчиститьИсториюРаботыПользователейВыполнить()
	ИсторияРаботыПользователя.ОчиститьВсе();
	ПоказатьОповещениеПользователя("", "", "История работы пользователей очищена!");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаУдалениеНажатие(Элемент)
	ОткрытьФорму("Обработка.УдалениеПомеченныхОбъектов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаППДНажатие(Элемент)
	ОткрытьФорму("Обработка.УправлениеПолнотекстовымПоиском.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаБлокировкаНажатие(Элемент)
	ОткрытьФорму("Обработка.БлокировкаСоединенийСИнформационнойБазой.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКонсольНажатие(Элемент)
	ОткрытьФорму("Обработка.КонсольРегламентныхЗаданий.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПользователиНажатие(Элемент)
	ОткрытьФорму("Обработка.АктивныеПользователи.Форма.ФормаСпискаАктивныхПользователей");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНастройкиФормНажатие(Элемент)
	ОткрытьФорму("Обработка.УправлениеНастройкамиФорм.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЖурналНажатие(Элемент)
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКонтрольЖурналаНажатие(Элемент)
	ОткрытьФорму("Обработка.КонтрольЖурналаРегистрации.Форма");
КонецПроцедуры
