
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы="Справочник.удуГрафикиРаботы.Форма.ФормаЭлемента" тогда
		ТекущийГод=ПараметрыВыполненияКоманды.Источник.ТекущийГод;
	Иначе	
		ТекущийГод=НачалоГода(ТекущаяДата());
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Справочник.удуГрафикиРаботы",
			"Печать",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			ТекущийГод
		);

КонецПроцедуры
