  // Процедура предназначена для преобразования номера документа.
//
// Параметры:
//  Номер - Строка - Номер документа
//
// Возвращаемое значение;
//  Строка - номер документа для печати
//
Функция ПолучитьНомерНаПечать(Знач Номер) Экспорт

	// Удаление ведущих нулей.
	Пока Лев(Номер, 1)= "0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	
	Возврат Номер;

КонецФункции // ПолучитьНомерНаПечать()

// Представление незаполненой даты в печатных формах документов.
//
// Параметры
//
// Возвращаемое значение:
//   Строка   - "___"_________20__ г.
//
Функция ПустаяДатаВПечатнойФорме() Экспорт

	Возврат """___""_________20__ г."

КонецФункции // ПустаяДатаВПечатнойФорме()