
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособНумерации = Перечисления.СпособыНумерации.Автоматически Тогда 
		ПроверяемыеРеквизиты.Добавить("Нумератор");
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	// Подсистема Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник__ВходящиеДокументы");
	
КонецПроцедуры
