
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Делопроизводство.ИспользоватьВидыВходящихДокументов() Тогда 
		Группы.Добавить("Входящие", "Входящие документы");
	КонецЕсли;	
	
	Если Делопроизводство.ИспользоватьВидыИсходящихДокументов() Тогда 
		Группы.Добавить("Исходящие", "Исходящие документы");
	КонецЕсли;	
	
	Если Делопроизводство.ИспользоватьВидыВнутреннихДокументов() Тогда 
		Группы.Добавить("Внутренние", "Внутренние документы");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Группы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		Значение = ТекущиеДанные.Значение;
		Элементы.Списки.ТекущаяСтраница = Элементы["Список" + Значение];
		Элементы.Панели.ТекущаяСтраница = Элементы["Панель" + Значение];
	КонецЕсли;	
	
КонецПроцедуры
