&НаСервере
Процедура СформироватьТабличнуюЧастьНаСервере()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления
	               |ИЗ
	               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(&ДатаВыбытия, Группа = &Группа) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних
	               |ГДЕ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.СостояниеУчетаВГруппе = &СостояниеУчетаВГруппе";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаВыбытия", ПараметрДата);
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	Запрос.УстановитьПараметр("СостояниеУчетаВГруппе", Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
		НоваяСтрокаВоспитанников = ТаблицаВоспитанников.Добавить();
		НоваяСтрокаВоспитанников.Обрабатывать = Истина;
		НоваяСтрокаВоспитанников.Ребенок = СтрокаРезультата.Ребенок;
		НоваяСтрокаВоспитанников.ОснованиеЗачисления = СтрокаРезультата.ОснованиеЗачисления;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиПозиции(Команда)
	// Вставить содержимое обработчика.
	ОповеститьОВыборе(ТаблицаВоспитанников);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТабличнуюЧастьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВоспитанниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "ТаблицаВоспитанниковРебенок" Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.Форма.ФормаЭлемента", ПередаваемыеПараметры, ЭтаФорма);
	ИначеЕсли (Поле.Имя = "ТаблицаВоспитанниковОснованиеЗачисления") Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.ОснованиеЗачисления);
		ОткрытьФормуМодально("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);		
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	// Вставить содержимое обработчика.
	Для Каждого СтрокаВоспитанника Из ТаблицаВоспитанников Цикл
		СтрокаВоспитанника.Обрабатывать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	// Вставить содержимое обработчика.
	Для Каждого СтрокаВоспитанника Из ТаблицаВоспитанников Цикл
		СтрокаВоспитанника.Обрабатывать = Ложь;
	КонецЦикла;	
КонецПроцедуры
