
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Получатель) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СпискиРассылкиПоКорреспондентамПолучатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СпискиРассылкиПоКорреспондентам.Получатели КАК СпискиРассылкиПоКорреспондентамПолучатели
		|ГДЕ
		|	СпискиРассылкиПоКорреспондентамПолучатели.Получатель = &Получатель";
		
		Запрос.УстановитьПараметр("Получатель", Параметры.Получатель);
		МассивПолучателей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		МассивПолучателей.Добавить(Параметры.Получатель);
		
		Параметры.Отбор.Вставить("Получатель", МассивПолучателей);
		Параметры.Отбор.Вставить("Отправлен", Истина);
	КонецЕсли;	
	
КонецПроцедуры
