&НаСервере
Процедура ИзменитьЗначенияРеквизитовОтВидаСчета()
	Если Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой Тогда
		Объект.Банк = Справочники.удуБанки.ПустаяСсылка();
		Если Не ЗначениеЗаполнено(Объект.НомерОрганаФК) Тогда
			Объект.НомерОрганаФК = Объект.Владелец.НомерОрганаФК;
		КонецЕсли;		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеОрганаФК) Тогда
			Объект.НаименованиеОрганаФК = Объект.Владелец.НаименованиеОрганаФК;
		КонецЕсли;
	Иначе
		Объект.БанкКазначейства = Справочники.удуБанки.ПустаяСсылка();
		Объект.НомерОрганаФК = "";
		Объект.НаименованиеОрганаФК = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидСчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодчиненныеЭлементы.ГруппаБанк.Видимость = Булево(Строка(Объект.ВидСчета) = "Расчетный");
	ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Булево(Строка(Объект.ВидСчета) = "Лицевой");
	
	ИзменитьЗначенияРеквизитовОтВидаСчета();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.ВидСчета) Тогда
		ПодчиненныеЭлементы.ГруппаБанк.Видимость = Булево(Строка(Объект.ВидСчета) = "Расчетный");
		ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Булево(Строка(Объект.ВидСчета) = "Лицевой");		
	Иначе
		ПодчиненныеЭлементы.ГруппаБанк.Видимость = Ложь;
		ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидСчета) Тогда
		Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой;
	КонецЕсли;
	
	Если Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой Тогда
		Если Не ЗначениеЗаполнено(Объект.НомерОрганаФК) Тогда
			Объект.НомерОрганаФК = Объект.Владелец.НомерОрганаФК;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеОрганаФК) Тогда
			Объект.НаименованиеОрганаФК = Объект.Владелец.НаименованиеОрганаФК;
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры
