
&НаКлиенте
Процедура НастроитьКнопкиПечати()
	
	СтрокаТЧ=Элементы.Список.ТекущиеДанные;
	
	Если СтрокаТЧ=Неопределено тогда
		Для Каждого КнопкаПечати из Элементы.Печать.ПодчиненныеЭлементы цикл
			КнопкаПечати.Видимость=Ложь;
		КонецЦикла;
	Иначе 
		Элементы.ФормаДокументудуКадровоеПеремещениеОрганизацийПечатьТ5.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуКадровоеПеремещениеОрганизаций"),Истина,Ложь);
		Элементы.ФормаДокументудуКадровоеПеремещениеОрганизацийПечатьТ5а.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуКадровоеПеремещениеОрганизаций"),Истина,Ложь);
		Элементы.ФормаДокументудуПриемНаРаботуВОрганизациюПечатьТ1.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуПриемНаРаботуВОрганизацию"),Истина,Ложь);
		Элементы.ФормаДокументудуПриемНаРаботуВОрганизациюПечатьТ1а.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуПриемНаРаботуВОрганизацию"),Истина,Ложь);
		Элементы.ФормаДокументудуУвольнениеИзОрганизацийПечатьТ8.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуУвольнениеИзОрганизаций"),Истина,Ложь);
		Элементы.ФормаДокументудуУвольнениеИзОрганизацийПечатьТ8а.Видимость=?(СтрокаТЧ.Тип=Тип("ДокументСсылка.удуУвольнениеИзОрганизаций"),Истина,Ложь);
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьКнопкиПечати();
	
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Организация       = Настройки.Получить("Организация");
	Сотрудник         = Настройки.Получить("Сотрудник");
	
	удуОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));	
    удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Значение", Сотрудник);	
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Сотрудник", Сотрудник);
	
КонецПроцедуры




&НаКлиенте
Процедура СотрудникДляОтбораПриИзменении(Элемент)
	
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Значение", Сотрудник);
	удуОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Сотрудник", Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияДляОтбораПриИзменении(Элемент)
	
	удуОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	НастроитьКнопкиПечати();
	
КонецПроцедуры

