&НаСервере
Процедура СформироватьСписокДоговоровНаСервере()
	ТекстЗапроса = "ВЫБРАТЬ
			|	удуДоговорОЗачисленииРебенка.Ссылка
			|ИЗ
			|	Документ.удуДоговорОЗачисленииРебенка КАК удуДоговорОЗачисленииРебенка
			|ГДЕ
			|	(НЕ удуДоговорОЗачисленииРебенка.ПометкаУдаления)				   
			|	И (НЕ удуДоговорОЗачисленииРебенка.ПроизошлоЗачисление)";
	
	Если ЗначениеЗаполнено(ПараметрГруппа) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
			|	И удуДоговорОЗачисленииРебенка.Группа = &Группа";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрРебенок) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
			|	И 	удуДоговорОЗачисленииРебенка.Ребенок = &Ребенок";
	КонецЕсли;
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ребенок", ПараметрРебенок);
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокСсылокДляОтбора = Новый СписокЗначений;
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		СписокСсылокДляОтбора.Добавить(СтрокаРезультат.Ссылка);		
	КонецЦикла;
	
	ЭлементОтбораНайден = Ложь;
	
	Для Каждого СтрокаЭлемент Из СписокДоговоровКЗачислению.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Ссылка" Тогда
			ЭлементОтбораНайден = Истина;
			СтрокаЭлемент.ПравоеЗначение = СписокСсылокДляОтбора;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЭлементОтбораНайден Тогда
		ЭлементОтбораРодителя = СписокДоговоровКЗачислению.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораРодителя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораРодителя.Использование = Истина;
		ЭлементОтбораРодителя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбораРодителя.ПравоеЗначение = СписокСсылокДляОтбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокДоговоровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровКЗачислениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйДоговор(Команда)
	// Вставить содержимое обработчика.
	ФормаВводаДоговора = ПолучитьФорму("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента");
	ФормаВводаДоговора.ОткрытьМодально();
	СформироватьСписокДоговоровНаСервере();
КонецПроцедуры
