
&НаКлиенте
Процедура КатегорияПрограммыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ПереданныеПараметры = Новый Структура("ВидПрограммы", "СоциальныеПрограммы");
	
	Результат = ОткрытьФормуМодально("Справочник.удуКатегорииПрограммПроектов.ФормаВыбора", ПереданныеПараметры);
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Запись.КатегорияПрограммы = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПрограмыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ПереданныеПараметры = Новый Структура("ВидПрограммы", "СоциальныеПрограммы");
	
	Результат = ОткрытьФормуМодально("Справочник.удуНаименованияПрограммПроектов.ФормаВыбора", ПереданныеПараметры);
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Запись.НаименованиеПрограмы = Результат;
	КонецЕсли;	
КонецПроцедуры
