&НаСервере
Процедура СформироватьСписокРодителей()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСоставСемьиРебенка.ЧленСемьи.Код КАК Код
	               |ИЗ
	               |	РегистрСведений.удуСоставСемьиРебенка КАК удуСоставСемьиРебенка
	               |ГДЕ
	               |	удуСоставСемьиРебенка.Ребенок = &Ребенок";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ребенок", ПараметрРебенок);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокКодовОтбора = Новый СписокЗначений;
	Для Каждого СтрокаРезультатаЗапроса Из РезультатЗапроса Цикл
		СписокКодовОтбора.Добавить(СтрокаРезультатаЗапроса.Код);
	КонецЦикла;
	
	ЭлементОтбораРодителя = РеквизитСписокРодителей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораРодителя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбораРодителя.Использование = Истина;
	ЭлементОтбораРодителя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код");
	ЭлементОтбораРодителя.ПравоеЗначение = СписокКодовОтбора;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокРодителей();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитСписокРодителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры
