Процедура ЗаполнитьПоДокументуОснованию(Знач ДокументОснование) Экспорт
	Дата = ТекущаяДата();
	Группа = ДокументОснование.ГруппаЖелаемая;
	Ребенок = ДокументОснование.Ребенок;
	Родитель = ДокументОснование.РодительПодавшийЗаявку;
	Учреждение = ДокументОснование.Учреждение;
	ПризнакФормированияБезЗаявки = Ложь;
	ЗаявкаОснование = ДокументОснование.Ссылка;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.удуЗаявкаНаЗачислениеРебенкаВДОУ") Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения.Ссылка);
	КонецЕсли;

КонецПроцедуры
                    