
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПолныйПуть();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПолныйПуть()
	
	ПапкаРодитель = Объект.Родитель;
	ПолныйПуть = "";
	Пока Не ПапкаРодитель.Пустая() Цикл
		
		ПолныйПуть = Строка(ПапкаРодитель) + "\" + ПолныйПуть;
		ПапкаРодитель = ПапкаРодитель.Родитель;
		
	КонецЦикла;
	
	ПолныйПуть = ПолныйПуть + Строка(Объект.Ссылка);
	
	Если Не ПустаяСтрока(ПолныйПуть) Тогда
		ПолныйПуть = """" + ПолныйПуть + """";
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ОбновитьПолныйПуть();
	
КонецПроцедуры
