
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуСведенияОКомплекатцииГруппы.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьКомплектация Из ТабличнаяЧастьКомплектация Цикл
		
		Движение = Движения.удуСведенияОКомплекатцииГруппы.Добавить();
		Движение.Период = Дата;
		Движение.Учреждение = Учреждение;
		Движение.Группа = ТекСтрокаТабличнаяЧастьКомплектация.ГруппаДляЗачисления;
		Движение.Ребенок = ТекСтрокаТабличнаяЧастьКомплектация.Ребенок;
		Движение.ВозрастнойПризнак = ТекСтрокаТабличнаяЧастьКомплектация.ВозрастнойПризнак;
		Движение.ПериодКомплектования = ПериодКомплектования;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры
