
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Руководитель) Тогда 
		МенеджерЗаписи = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Объект.Руководитель;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Подразделение <> ТекущийОбъект.Ссылка Тогда 
			МенеджерЗаписи.Пользователь = Объект.Руководитель;
			МенеджерЗаписи.Подразделение = ТекущийОбъект.Ссылка;
			МенеджерЗаписи.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
