
&НаСервере
Процедура УстановитьЗаголовкиОрганизацийВФорме()
	
	ЭтаФорма.Заголовок = "Сведения о штатной единице организации";
	
КонецПроцедуры // УстановитьЗаголовкиОрганизацийВФорме()

&НаСервере
Функция ПолучитьСписокДолжностей()
	
	Возврат  удуПроцедурыУправленияПерсоналом.ВыбратьИзШтатногоРасписанияОрганизации("Должность", Запись.ПодразделениеОрганизации.Организация, Запись.ПодразделениеОрганизации);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДолжностей = ПолучитьСписокДолжностей();
	
	КоличествоЗначений = СписокДолжностей.Количество();
	Элементы.Должность.КнопкаСпискаВыбора = КоличествоЗначений > 0;
	УстановитьЗаголовкиОрганизацийВФорме();

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ


&НаКлиенте
Процедура ДолжностьНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокДолжностей();
	
	Элемент.ВысотаСпискаВыбора = Мин(10, СписокВыбора.Количество());
	ЭлементСписка = ВыбратьИзСписка(СписокВыбора,Элемент,СписокВыбора.НайтиПоЗначению(Запись.Должность));
	Если ЭлементСписка <> Неопределено Тогда
		Запись.Должность = ЭлементСписка.Значение;
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
