
&НаКлиенте
Процедура ЗаписатьРеестр(Команда)
	Если СписокЗакрытыеРеестры.Количество() > 0 Тогда
		Если Элементы.СписокЗакрытыеРеестры.ВыделенныеСтроки.Количество() > 0 Тогда 
			ВыбранныйРеестр = Элементы.СписокЗакрытыеРеестры.ТекущиеДанные.ЗакрытыйРеестр;
			Закрыть(ВыбранныйРеестр);	
		Иначе
			Вопрос("Реестр не выбран.",РежимДиалогаВопрос.ОК);
		КонецЕсли;
	Иначе
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗакрытыхРеестров()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	удуРеестрыОтправки.Ссылка,
	|	удуРеестрыОтправки.ДатаЗакрытия
	|ИЗ
	|	Справочник.удуРеестрыОтправки КАК удуРеестрыОтправки
	|ГДЕ
	|	удуРеестрыОтправки.Статус = &Статус
	|	И удуРеестрыОтправки.ТипРеестра.СпособОтправки = &ВидДоставки");
	
	Запрос.УстановитьПараметр("Статус",Перечисления.удуСтатусОтправки.Закрытый);
	Запрос.УстановитьПараметр("ВидДоставки",ВидДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТЧ = СписокЗакрытыеРеестры.Добавить();	
		НоваяСтрокаТЧ.ЗакрытыйРеестр = Выборка.Ссылка;
		НоваяСтрокаТЧ.ДатаЗакрытия = Выборка.ДатаЗакрытия;
	КонецЦикла;
	
	
КонецПроцедуры // СформироватьСписокЗакрытыхРеестров()

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	СписокЗакрытыеРеестры.Очистить();
	СформироватьСписокЗакрытыхРеестров();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры


