
Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Предупредим о "последствиях" пустой фамилии
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Фамилия) Тогда
			СтрокаСообщенияОбОшибке = "Для физического лица " + СтрокаНабора.ФизЛицо + " не указана фамилия. Возможны ошибки представления в отчетах! " + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаСообщенияОбОшибке) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст=СтрокаСообщенияОбОшибке;
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
