
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуВзаиморасчетыСРодителями.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	удуНачислениеРПСписокНачислений.Ребенок,
	|	СУММА(удуНачислениеРПСписокНачислений.Сумма) КАК Сумма
	|ИЗ
	|	Документ.удуНачислениеРП.СписокНачислений КАК удуНачислениеРПСписокНачислений
	|ГДЕ
	|	удуНачислениеРПСписокНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	удуНачислениеРПСписокНачислений.Ребенок";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Учреждение", Учреждение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.удуВзаиморасчетыСРодителями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Учреждение = Учреждение;
			ЗаполнитьЗначенияСвойств(Движение,Выборка);			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
