Процедура ЗаполнитьНачальныеНастройки(Объект, НачальноеЗаполнение = Истина) Экспорт
	
	СхемаКомпоновкиДанных=Обработки.удуФормированиеСпискаРаботников.ПолучитьМакет("Макет");
	
	удуУправлениеОтчетами.ИнициализироватьКомпоновщикНастроек(Объект.КомпоновщикНастроек, ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	 		
КонецПроцедуры

Функция ПолучитьСписокРаботников(Объект) Экспорт
	
	СхемаКомпоновкиДанных=Обработки.удуФормированиеСпискаРаботников.ПолучитьМакет("Макет");
	КомпоновщикМакетаКомпоновкиДанных=Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек=Новый КомпоновщикНастроекКомпоновкиДанных;
	
	удуУправлениеОтчетами.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Объект.КомпоновщикНастроек.ПолучитьНастройки());
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ГоловнаяОрганизация", Объект.Организация, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ДатаАктуальности", Объект.ДатаАктуальности, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ВключатьУволенных", Объект.ВключатьУволенных, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ДатаУвольнения", Объект.ДатаУволенных, Истина);
	
	
	МакетКомпоновкиДанных=КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ=Новый ТаблицаЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.УстановитьОбъект(ТЗ);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТЗ;
			 		
КонецФункции

