// Сформировать заголовок группы Файлы
Функция КоличествоФайловВЗаголовок(КоличествоФайлов) Экспорт
	Заголовок = "Файлы";
	
	Если КоличествоФайлов <> 0 Тогда 
		Заголовок = "Файлы (" + КоличествоФайлов + ")";
	КонецЕсли;	
	
	Возврат Заголовок;
КонецФункции	

Функция ЭтоСсылкаНаДокумент(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") 
	 Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") 
	 Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда	
	 	Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Функция ПодписьЛет(Количество) Экспорт
	
	Если Количество > 10 И Количество < 20 Тогда 
		Возврат  "лет";
	Иначе	
		Срок = Количество - Цел(Количество / 10) * 10;
		Если Срок = 0 Тогда
			Возврат "лет";
		ИначеЕсли Срок = 1 Тогда 
			Возврат "год";
		ИначеЕсли Срок < 5 Тогда 
			Возврат "года";
		Иначе 
			Возврат "лет";
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции	