
&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ТД = Элементы.ВозможныеЗначения.ТекущиеДанные;
	Если ТД <> Неопределено Тогда		
		ЭтаФорма.Закрыть(ТД.Значение);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Ключ) = Тип("СписокЗначений") Тогда
		ТЗ = Новый ТаблицаЗначений();
		ТЗ.Колонки.Добавить("Значение");
		Для Каждого знч Из Параметры.Ключ Цикл
			Стр = ТЗ.Добавить();
			Стр.Значение = знч;
		КонецЦикла;
		ВозможныеЗначения.Загрузить(ТЗ);
	Иначе
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст=НСтр("ru = 'Ошибка в ключевом параметре! Форме выбора в качестве ключа необходимо передать список значений.'");		
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозможныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьЗначение(Неопределено);

КонецПроцедуры
