
&НаКлиенте
Процедура История(Команда)
	
	ФормаИстории= ПолучитьФорму("РегистрСведений.удуСемейноеПоложениеФизЛиц.ФормаСписка",,ЭтаФорма);
	ЭлементОтбора=ФормаИстории.Список.Отбор.элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование=Истина;
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=ФизЛицо;
	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ФизЛицо");
	ФормаИстории.открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИзменения(Команда)
	Закрыть(СравнитьДанные());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураДанных=ПолучитьИзВременногоХранилища(Параметры.АдресНачальныхДанных);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураДанных);
	АдресНачальныхДанных=Параметры.АдресНачальныхДанных;
	
	Если ФизЛицо.Пустая() тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.История.Видимость=Ложь;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.История.Доступность=Ложь;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Период) тогда
		 Период=Дата(1900,01,01);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СравнитьДанные()
	
	Перем НачальноеЗначение, КонечноеЗначение;
	
	СтруктураДанных=ПолучитьИзВременногоХранилища(АдресНачальныхДанных);
	СтруктураДанныхНовая=Новый Структура;
	Для Каждого ЭлементСтруктуры из СтруктураДанных цикл
		СтруктураДанныхНовая.Вставить(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураДанныхНовая,ЭтаФорма);
	
	ПризнакИзменения=Ложь;
	МассивРеквизитов=ПолучитьРеквизиты();
	
	Для Каждого ЭлементМассива из МассивРеквизитов цикл
		СтруктураДанных.Свойство(ЭлементМассива.Имя, НачальноеЗначение); 
		СтруктураДанныхНовая.Свойство(ЭлементМассива.Имя, КонечноеЗначение);
		Если не НачальноеЗначение=КонечноеЗначение тогда
			 ПризнакИзменения=Истина;
			 Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПризнакИзменения тогда
         Возврат СтруктураДанныхНовая;
	 Иначе 
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

