////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьСтрокиПоиска();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПолеВводаПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИскатьВыполнить();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоискаПриИзменении(Элемент)
	ИскатьВыполнить();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИскатьВыполнить()
	
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.1, Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если ПустаяСтрока(Элементы.ПолеВводаПоиска.ТекстРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("", );
	ПараметрыФормы.Вставить("ПереданнаяСтрокаПоиска", Элементы.ПолеВводаПоиска.ТекстРедактирования);
	ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма.ФормаПоиска", ПараметрыФормы, , Новый УникальныйИдентификатор);
	
	ЗагрузитьСтрокиПоиска();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтрокиПоиска()
	Массив = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПолнотекстовыйПоискСтрокиПолнотекстовогоПоиска");
	
	Если Массив <> Неопределено Тогда
		Элементы.ПолеВводаПоиска.СписокВыбора.ЗагрузитьЗначения(Массив);
	КонецЕсли;
КонецПроцедуры	

