&НаСервере
Процедура СформироватьНаименованиеДокумента()
	Объект.Наименование = СокрЛП(Объект.ВидДокумента.Наименование) + 
	?(ЗначениеЗаполнено(Объект.НомерДокумента), " № " + СокрЛП(Объект.НомерДокумента), "") + 
	?(ЗначениеЗаполнено(Объект.СерияДокумента), " серия " + СокрЛП(Объект.СерияДокумента), "") + 
	?(ЗначениеЗаполнено(Объект.ДатаВыдачиДокумента), " от " + Формат(Объект.ДатаВыдачиДокумента, "ДЛФ=D"), "");
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СерияДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		ФормаВыбораРодителя = ПолучитьФорму("ОбщаяФорма.удуФормаВыбораРодителя");
		ФормаВыбораРодителя.ПараметрРебенок = Объект.Владелец;
		ФормаВыбораРодителя.ВладелецФормы = ЭтаФорма;
		ФормаВыбораРодителя.ОткрытьМодально();				
	Иначе
		Вопрос("Перед выбором родителя необходимо выбрать ребенка!", РежимДиалогаВопрос.ОК);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.удуРодители") Тогда
		Объект.РодительЧленСемьи = ВыбранноеЗначение;
	КонецЕсли;	
КонецПроцедуры
