
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьОбложки(ТабДок, ПараметрКоманды);

	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОбложкаДела";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Обложка дела");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьОбложки(ТабДок, Ссылки)
	
	Справочники.ДелаХраненияДокументов.ПечатьОбложки(ТабДок, Ссылки);
	
КонецПроцедуры	