
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ТАБЕЛЯ УЧЕТА ПОСЕЩАЕМОСТИ

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
	Функция СоставитьСписокДетейГруппы(Знач НаДату = Неопределено, 
		Знач ОкончаниеПериода = Неопределено, 
		Знач ГруппаДДУ, 
		РассчитатьЗадолженность = Ложь, 
		Знач Организация = Неопределено) Экспорт
	
	
	Если НаДату = Неопределено Тогда	
		НаДату = ТекущаяДатаСеанса();		
	КонецЕсли;	
	
	НаДату = НачалоДня(НаДату);	
	Если НЕ ОкончаниеПериода = Неопределено Тогда		
		ОкончаниеПериода = КонецДня(ОкончаниеПериода);		
		Если ОкончаниеПериода < НаДату	Тогда			
			Возврат Неопределено;				
		КонецЕсли;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("ГруппаДДУ", ГруппаДДУ);
	Запрос.УстановитьПараметр("Учреждение", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Период,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Группа КАК ГруппаДетскогоУчреждения,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления.Ссылка КАК Договор,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления.ОплатаПоДоговору КАК СтавкаОплаты
	               |ИЗ
	               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(
	               |			&НаДату,
	               |			Учреждение = &Учреждение
	               |				И Группа = &ГруппаДДУ) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних
	               |ГДЕ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.СостояниеУчетаВГруппе = ЗНАЧЕНИЕ(Перечисление.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу)";
				   
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	
#КонецЕсли
