
////////////////////////////////////////////////////////////
//
//	ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборУчреждение = Константы.удуОсновноеУчреждение.Получить();
	ОтборУчреждениеПриИзмененииНаСервере();
КонецПроцедуры


////////////////////////////////////////////////////////////
//
//	ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборУчреждениеПриИзменении(Элемент)
	ОтборУчреждениеПриИзмененииНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////
//
//	ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////
//
//	ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОтборУчреждениеПриИзмененииНаСервере()
	удуОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Учреждение", ОтборУчреждение, ВидСравненияКомпоновкиДанных.Равно);
	ОтборГруппаДетскогоУчреждения = Справочники.удуГруппыУчреждения.ПустаяСсылка();
КонецПроцедуры



