// Вовращает значение Перечисление.СтатусОтправки в зависимости от строкового параметра
// Параметры: 
//		Статус - строка "Текущий" или "ЗакрытыйИОтправленный".
//
&НаСервере
Функция СтатусОтправки(Знач Статус)
	Если Статус = "Текущий" Тогда
		Возврат	Перечисления.удуСтатусОтправки.Текущий;
	КонецЕсли;
	Если Статус = "Закрытый" Тогда
		Возврат	Перечисления.удуСтатусОтправки.Закрытый;
	КонецЕсли;
	Если Статус = "Отправленный" Тогда
		Возврат	Перечисления.удуСтатусОтправки.Отправленный;
	КонецЕсли;

	Возврат "";
КонецФункции // СтатусОтправки()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.Объект.Статус = СтатусОтправки("Закрытый")
		ИЛИ ПараметрыВыполненияКоманды.Источник.Объект.Статус = СтатусОтправки("Отправленный") Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.РазмерСтраницы = "A5";
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ПечатьКонвертБольшой(ТабДок, ПараметрКоманды);
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать();
	Иначе Вопрос("Для вывода на печать выбранный реестр должен быть закрыт", РежимДиалогаВопрос.ОК);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьКонвертБольшой(ТабДок, ПараметрКоманды)
	Справочники.удуРеестрыОтправки.ПечатьКонвертБольшой(ТабДок, ПараметрКоманды);
КонецПроцедуры
