&НаСервере
Функция ВернутьСтатусСостоитВГруппе()
	Возврат Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("Группа", Элементы.Список.ТекущаяСтрока);
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("СостояниеУчетаВГруппе", ВернутьСтатусСостоитВГруппе());
КонецПроцедуры

&НаКлиенте
Процедура СписокДетейГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "Ребенок" Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.Форма.ФормаЭлемента", ПередаваемыеПараметры, ЭтаФорма);
	ИначеЕсли Поле.Имя = "ОснованиеЗачисления" Тогда
		СтандартнаяОбработка = Ложь;
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.ОснованиеЗачисления);
		ОткрытьФормуМодально("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Учреждение = Константы.удуОсновноеУчреждение.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура УчреждениеПриИзменении(Элемент)
	УстановитьОтборПоУчреждению();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУчреждению()
	Список.Параметры.УстановитьЗначениеПараметра("Учреждение", Учреждение);
	Дерево.Параметры.УстановитьЗначениеПараметра("Учреждение", Учреждение);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если не Группа Тогда
		Отказ=Истина;
		ОткрытьФорму("Справочник.удуГруппыУчреждения.Форма.ФормаЭлемента",Новый Структура("Учреждение, Родитель",Учреждение, Элементы.Дерево.ТекущаяСтрока),Элементы.Список);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборПоУчреждению();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если не Группа Тогда
		Отказ=Истина;
		ОткрытьФорму("Справочник.удуГруппыУчреждения.Форма.ФормаЭлемента",Новый Структура("Учреждение, Родитель",Учреждение, Элементы.Дерево.ТекущаяСтрока),Элементы.Список);	
	КонецЕсли;	
КонецПроцедуры
