
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Результат = удуРегистрацияУчетныхДокументовСервер.РегистрироватьДокумент(ПараметрКоманды);
	Если Результат.Успешно Тогда

		ИмяФормы = "";
		Если ТипЗнч(Результат.Документ) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
			ИмяФормы = "Справочник.ВходящиеДокументы.ФормаОбъекта";
		ИначеЕсли ТипЗнч(Результат.Документ) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
			ИмяФормы = "Справочник.ИсходящиеДокументы.ФормаОбъекта";
		ИначеЕсли ТипЗнч(Результат.Документ) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
			ИмяФормы = "Справочник.ВнутренниеДокументы.ФормаОбъекта";
		КонецЕсли;
		
		Если ИмяФормы <> "" Тогда
			ПараметрОткрытия = Новый Структура("Ключ", Результат.Документ);
			ПолучитьФорму(ИмяФормы, ПараметрОткрытия).Открыть();
			
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст="В процессе регистрации документа произошла ошибка:" + Символы.ПС + "Неправильный тип документа";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
			
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст="В процессе регистрации документа произошла ошибка:" + Символы.ПС + Результат.Сообщение;
		СообщениеПользователю.Сообщить();
		КонецЕсли;
		
КонецПроцедуры
