
&НаКлиенте
Процедура СписокКорреспондентыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСпискиРассылкиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Корреспонденты Тогда 
		ОповеститьОВыборе(Элементы.СписокКорреспонденты.ТекущаяСтрока);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СпискиРассылки Тогда 
		ОповеститьОВыборе(Элементы.СписокСпискиРассылки.ТекущаяСтрока);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Получатель = Параметры.Получатель;
	Если ЗначениеЗаполнено(Получатель) Тогда
		Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Корреспонденты") Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Корреспонденты;
			Элементы.СписокКорреспонденты.ТекущаяСтрока = Получатель;
			
		ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.СпискиРассылкиПоКорреспондентам") Тогда
		    Элементы.Страницы.ТекущаяСтраница = Элементы.СпискиРассылки;
			Элементы.СписокСпискиРассылки.ТекущаяСтрока = Получатель;
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
