
&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	
	Если Не ПустаяСтрока(СтрокаПоиска) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = СтрокаПоиска;
	КонецЕсли;	
		
КонецПроцедуры
